---
kind: method
id: M:Autodesk.Revit.DB.NurbsSurfaceData.GetKnotsU
source: html/e280fd98-bad6-3fb3-547f-a829ab23a9de.htm
---
# Autodesk.Revit.DB.NurbsSurfaceData.GetKnotsU Method

Get the list of knots in the u-direction.

## Syntax (C#)
```csharp
public IList<double> GetKnotsU()
```